Reports/КонтрольПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КонтрольПроекта</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлановаяГотовностьПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлановаяГотовностьПомещений</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановаяГотовностьПомещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСоздание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаГотовности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ГабаритныеЧертежи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельГотоваДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииБитрикса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/КонтрольПроекта/Forms/ФормаСозданиеДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Проект = Параметры.Проект;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	ПолеВывода.Очистить();
	
	стДанные = СоздатьПлановаяГотовностьПомещений();
	СоздатьЗадачиСоздатьМодельГабаритногоЧертежа(стДанные);
	
	ВывестиЛог(стДанные);

КонецПроцедуры 

Процедура СоздатьЗадачиСоздатьМодельГабаритногоЧертежа(стДанные)

	стДанные.Вставить("Задачи", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
			|	ДатыКомплекта.Комплект.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
			|	ДатыКомплекта.НачалоПКД КАК НачалоПКД
			|ПОМЕСТИТЬ втГЧ
			|ИЗ
			|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|ГДЕ
			|	ДатыКомплекта.Проект = &Проект
			|	И ДатыКомплекта.НачалоПКД > ДАТАВРЕМЯ(1, 1, 1)
			|	И НЕ ДатыКомплекта.Комплект.ГабаритныйЧертеж = ЗНАЧЕНИЕ(Справочник.ГабаритныеЧертежи.ПустаяСсылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(втГЧ.НачалоПКД) КАК НачалоПКД,
			|	втГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж
			|ПОМЕСТИТЬ втМинГЧ
			|ИЗ
			|	втГЧ КАК втГЧ
			|
			|СГРУППИРОВАТЬ ПО
			|	втГЧ.ГабаритныйЧертеж
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(СоздатьМодельГабаритногоЧертежа.Ссылка, НЕОПРЕДЕЛЕНО) КАК Задача,
			|	втМинГЧ.ГабаритныйЧертеж КАК ГабаритныйЧертеж,
			|	втМинГЧ.НачалоПКД КАК НачалоПКД,
			|	втМинГЧ.ГабаритныйЧертеж.Проект КАК Проект,
			|	втМинГЧ.ГабаритныйЧертеж.Наименование КАК ГабаритныйЧертежНаименование
			|ИЗ
			|	втМинГЧ КАК втМинГЧ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.СоздатьМодельГабаритногоЧертежа КАК СоздатьМодельГабаритногоЧертежа
			|		ПО втМинГЧ.ГабаритныйЧертеж = СоздатьМодельГабаритногоЧертежа.ГабаритныйЧертеж
			|ГДЕ
			|	ЕСТЬNULL(СоздатьМодельГабаритногоЧертежа.КрайняяДатаИсполнения, ДАТАВРЕМЯ(1, 1, 1)) <> втМинГЧ.НачалоПКД
			|	И НЕ ЕСТЬNULL(СоздатьМодельГабаритногоЧертежа.Выполнена, ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Исполнитель = Неопределено;
	
	ЗадачаСсылка = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если Исполнитель = Неопределено И Выборка.Задача = Неопределено Тогда
			Исполнитель = омЗадачи.ПолучитьИсполнителя(Перечисления.ОбъектыЗадач.ПроверятьГабаритныеЧерчежи);
		КонецЕсли;
		
		Описание = СоздатьИзменитьЗадачу(Выборка, Исполнитель, ЗадачаСсылка);
		
		стДанные.Задачи.Добавить(Новый Структура("Документ, Действие", ЗадачаСсылка, Описание));
		
	КонецЦикла;
	
КонецПроцедуры 

Функция СоздатьИзменитьЗадачу(Выборка, Исполнитель, ЗадачаСсылка)

	Если Выборка.Задача = Неопределено Тогда
	
		Задача = Задачи.СоздатьМодельГабаритногоЧертежа.СоздатьЗадачу();
		Задача.ГабаритныйЧертеж = Выборка.ГабаритныйЧертеж;
		Задача.Дата 			= ТекущаяДата();
		Задача.Исполнитель 		= Исполнитель;
		Задача.Проект 			= Выборка.Проект;
		Задача.Наименование 	= Выборка.ГабаритныйЧертежНаименование + ".Создание";

	Иначе
	
		Задача = Выборка.Задача.ПолучитьОбъект();	
	
	КонецЕсли;
	
	Задача.КрайняяДатаИсполнения = Выборка.НачалоПКД;
	
    Задача.Записать();
	
	ЗадачаСсылка = Задача.Ссылка;
	
	Возврат ?(Выборка.Задача = Неопределено, "Создана ", "Изменена ") + Задача.Наименование
			+ ". Крайняя дата " + Формат(Выборка.НачалоПКД, "ДФ=dd.MM.yy");
	
	
КонецФункции // СоздатьИзменитьЗадачу(Выборка, Исполнитель)

Функция СоздатьПлановаяГотовностьПомещений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ЕСТЬNULL(ДатыКомплекта.НачалоРКД, ДАТАВРЕМЯ(1, 1, 1))) КАК НачалоРКД,
		|	Помещения.Ссылка КАК Помещение
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
		|			ПО ИзделияКомплектИзделияЭлемент.Ссылка = ДатыКомплекта.Комплект
		|				И (ЕСТЬNULL(ДатыКомплекта.НачалоРКД, ДАТАВРЕМЯ(1, 1, 1)) > ДАТАВРЕМЯ(1, 1, 1))
		|		ПО (ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент.Помещения = Помещения.Ссылка)
		|ГДЕ
		|	Помещения.Проект = &Проект
		|	И НЕ Помещения.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	Помещения.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Помещения.НомерПомещения,
		|	Помещения.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановаяГотовностьПомещений.Ссылка КАК Ссылка,
		|	ПлановаяГотовностьПомещений.Утвержден КАК Утвержден
		|ИЗ
		|	Документ.ПлановаяГотовностьПомещений КАК ПлановаяГотовностьПомещений
		|ГДЕ
		|	ПлановаяГотовностьПомещений.Проект = &Проект
		|	И ПлановаяГотовностьПомещений.АвтоматическоеСоздание";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[1].Выбрать();
	
	обПлановаяГотовностьПомещений = Неопределено; 
	УтвержденПлановаяГотовностьПомещений = Ложь;
	
	Пока Выборка.Следующий() Цикл
		обПлановаяГотовностьПомещений 			= Выборка.Ссылка.ПолучитьОбъект();
		УтвержденПлановаяГотовностьПомещений 	= Выборка.Утвержден;
	КонецЦикла; 
	
	НужнаЗапись 	= Ложь;
	
	Если обПлановаяГотовностьПомещений = Неопределено Тогда
		
		обПлановаяГотовностьПомещений 							= Документы.ПлановаяГотовностьПомещений.СоздатьДокумент();
		обПлановаяГотовностьПомещений.Автор 					= ПараметрыСеанса.ТекущийПользователь;
		обПлановаяГотовностьПомещений.Дата						= ТекущаяДата();
		обПлановаяГотовностьПомещений.АвтоматическоеСоздание 	= Истина;
		обПлановаяГотовностьПомещений.Проект					= Проект;
		
		ДействиеДокумента = "Документ создан";
		
		НовыйДокумент 	= Истина;
	
	Иначе
		
		НовыйДокумент 	= Ложь;
		ДействиеДокумента = "Документ найден";
		
	КонецЕсли;
	
	Выборка = Результат[0].Выбрать();
	
	соДействиеКомплекта = Новый Соответствие;
	
	стОтбор = Новый Структура("Помещение", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.Помещение = Выборка.Помещение;
		
		НайденыеСтроки = обПлановаяГотовностьПомещений.Помещения.НайтиСтроки(стОтбор);
		
		Если НайденыеСтроки.Количество() = 0 Тогда
			
			НС = обПлановаяГотовностьПомещений.Помещения.Добавить();
			
			НС.Помещение 		= Выборка.Помещение;
			НС.ДатаГотовности 	= Выборка.НачалоРКД;
			
			соДействиеКомплекта.Вставить(Выборка.Помещение
				, "Дата добавлена " + Формат(Выборка.НачалоРКД, "ДФ=dd.MM.yy"));	
			
			НужнаЗапись = Истина; 
		Иначе
			Для каждого х Из НайденыеСтроки Цикл
				
				СтрокаСДатами = "Текущая дата " + Формат(х.ДатаГотовности, "ДФ=dd.MM.yy") + ", начало РКД " + Формат(Выборка.НачалоРКД, "ДФ=dd.MM.yy"); 
				
				Если х.ДатаГотовности = Выборка.НачалоРКД Тогда
					Продолжить;
				КонецЕсли;
				
				Если УтвержденПлановаяГотовностьПомещений Тогда
					соДействиеКомплекта.Вставить(Выборка.Помещение
						, "Дата не изменена. " + СтрокаСДатами);	
				Иначе
					
					х.ДатаГотовности = Выборка.НачалоРКД;
					соДействиеКомплекта.Вставить(Выборка.Помещение
						, "Дата изменена. " + СтрокаСДатами);	
					
					НужнаЗапись = Истина; 
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НужнаЗапись Тогда
	
		обПлановаяГотовностьПомещений.Записать(РежимЗаписиДокумента.Проведение);	
	
	КонецЕсли;
	
	Возврат Новый Структура("ПлановаяГотовностьПомещений", 
		Новый Структура("ДействиеДокумента, соДействиеКомплекта, ПлановаяГотовностьПомещений", ДействиеДокумента, соДействиеКомплекта, обПлановаяГотовностьПомещений.Ссылка));
	
КонецФункции // СоздатьПлановаяГотовностьПомещений()

Процедура ВывестиЛог(стДанные)

    стПлановаяГотовностьПомещений = стДанные.ПлановаяГотовностьПомещений;
	
	Макет = Отчеты.КонтрольПроекта.ПолучитьМакет("МакетСозданиеДокументов");
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	
	ПолеВывода.НачатьАвтогруппировкуСтрок();
	обСтрока.Параметры.Документ = стПлановаяГотовностьПомещений.ПлановаяГотовностьПомещений;
	обСтрока.Параметры.Действие = стПлановаяГотовностьПомещений.ДействиеДокумента;
	ПолеВывода.Вывести(обСтрока, 1);                                              
	
	соДействиеКомплекта = стПлановаяГотовностьПомещений.соДействиеКомплекта;
	
	Для каждого х Из соДействиеКомплекта Цикл
		обСтрока.Параметры.Документ = х.Ключ;
		обСтрока.Параметры.Действие = х.Значение;
		ПолеВывода.Вывести(обСтрока, 2);                                              
	КонецЦикла;
	
	ПолеВывода.ЗакончитьАвтогруппировкуСтрок(); 
	
	Для каждого х Из стДанные .Задачи Цикл
		обСтрока.Параметры.Заполнить(х);
		ПолеВывода.Вывести(обСтрока);                                             	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры
